sglang_local_10rq_40G.txt
Namespace(backend='sglang', base_url='https://sglang01.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=40960, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=10.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
============ Serving Benchmark Result ============
Successful requests:                     40920     
Benchmark duration (s):                  4151.83   
Total input tokens:                      9091986   
Total generated tokens:                  7856747   
Request throughput (req/s):              9.86      
Input token throughput (tok/s):          2189.88   
Output token throughput (tok/s):         1892.36   
---------------Time to First Token----------------
Mean TTFT (ms):                          264.19    
Median TTFT (ms):                        247.40    
P99 TTFT (ms):                           507.11    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          105.29    
Median TPOT (ms):                        102.87    
P99 TPOT (ms):                           169.00    
---------------Inter-token Latency----------------
Mean ITL (ms):                           103.87    
Median ITL (ms):                         83.54     
P99 ITL (ms):                            415.29    
==================================================