sglang_local_11rq_40G.txt
Namespace(backend='sglang', base_url='https://sglang01.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=40960, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=11.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 11.0
============ Serving Benchmark Result ============
Successful requests:                     40947     
Benchmark duration (s):                  3821.57   
Total input tokens:                      9097592   
Total generated tokens:                  7867882   
Request throughput (req/s):              10.71     
Input token throughput (tok/s):          2380.59   
Output token throughput (tok/s):         2058.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          252.68    
Median TTFT (ms):                        250.98    
P99 TTFT (ms):                           518.61    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          137.05    
Median TPOT (ms):                        139.39    
P99 TPOT (ms):                           220.10    
---------------Inter-token Latency----------------
Mean ITL (ms):                           135.77    
Median ITL (ms):                         98.01     
P99 ITL (ms):                            535.75    
==================================================